-- 1
SELECT КОД, ДАТА
	FROM Н_ВЕДОМОСТИ LEFT JOIN Н_ОЦЕНКИ 
		ON Н_ВЕДОМОСТИ.ОЦЕНКА = Н_ОЦЕНКИ.КОД 
	WHERE 
		Н_ОЦЕНКИ.ПРИМЕЧАНИЕ < 'неудовлетворительно' AND 
		Н_ВЕДОМОСТИ.ИД < 1490007;
-- 2
SELECT ЧЛВК_И_ВЕД.ИД, ЧЛВК_И_ВЕД.ЧЛВК_ИД, Н_СЕССИЯ.УЧГОД
	FROM 
		(
			SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ЧЛВК_ИД FROM
				(SELECT ИД FROM Н_ЛЮДИ WHERE ИД = 100012) Н_ЛЮДИ LEFT JOIN Н_ВЕДОМОСТИ
					ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
				WHERE
					ДАТА < '2022-06-08'
		) ЧЛВК_И_ВЕД LEFT JOIN Н_СЕССИЯ
			ON ЧЛВК_И_ВЕД.ЧЛВК_ИД = Н_СЕССИЯ.ЧЛВК_ИД
		WHERE
			Н_СЕССИЯ.ДАТА < '2004-01-17';
-- 3
SELECT COUNT(*)
	FROM (
		(
			SELECT ОТД_ИД AS ОТД FROM (
				SELECT ЭСТ_ИД FROM (
					SELECT Н_ВЕДОМОСТИ.СЭС_ИД
						FROM Н_ЛЮДИ LEFT JOIN Н_ВЕДОМОСТИ
							ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
						WHERE Н_ЛЮДИ.ОТЧЕСТВО = '.'
				)
				RIGHT JOIN Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК
					ON Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК.ИД = СЭС_ИД
			)
			LEFT JOIN Н_ЭЛЕМЕНТЫ_СТРОК
				ON Н_ЭЛЕМЕНТЫ_СТРОК.ИД = ЭСТ_ИД
		) 
		LEFT JOIN Н_ОТДЕЛЫ
			ON ОТД = Н_ОТДЕЛЫ.ИД
	)
	WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ';

