-- 2 NO COLUMN SELECTS
SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.УЧГОД
	FROM
		(SELECT ИД FROM Н_ЛЮДИ WHERE ИД = 100012) Н_ЛЮДИ LEFT JOIN Н_ВЕДОМОСТИ
			ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
		LEFT JOIN Н_СЕССИЯ
			ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_СЕССИЯ.ЧЛВК_ИД
	WHERE
		Н_СЕССИЯ.ДАТА < '2004-01-17';

-- 3 NO COLUMN SELECTS
SELECT COUNT(*)
	FROM
		(SELECT Н_ЛЮДИ.ИД FROM Н_ЛЮДИ WHERE Н_ЛЮДИ.ОТЧЕСТВО = '.') Н_ЛЮДИ
		LEFT JOIN Н_ВЕДОМОСТИ
			ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
		RIGHT JOIN Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК
			ON Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК.ИД = Н_ВЕДОМОСТИ.СЭС_ИД
		LEFT JOIN Н_ЭЛЕМЕНТЫ_СТРОК
			ON Н_ЭЛЕМЕНТЫ_СТРОК.ИД = Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК.ЭСТ_ИД
		INNER JOIN (SELECT Н_ОТДЕЛЫ.ИД FROM Н_ОТДЕЛЫ WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ') Н_ОТДЕЛЫ
			ON Н_ЭЛЕМЕНТЫ_СТРОК.ОТД_ИД = Н_ОТДЕЛЫ.ИД;

-- 4 NO COLUMN SELECTS
SELECT Н_ПЛАНЫ.ПЛАН_ИД
	FROM Н_ГРУППЫ_ПЛАНОВ INNER JOIN Н_ПЛАНЫ
		ON Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
	INNER JOIN (SELECT Н_ОТДЕЛЫ.ИД FROM Н_ОТДЕЛЫ WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ') Н_ОТДЕЛЫ
		ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
	GROUP BY Н_ПЛАНЫ.ПЛАН_ИД
	HAVING COUNT(*) > 1
	ORDER BY Н_ПЛАНЫ.ПЛАН_ИД;