-- 2
SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.УЧГОД
	FROM Н_ЛЮДИ LEFT JOIN Н_ВЕДОМОСТИ
		ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
	LEFT JOIN Н_СЕССИЯ
		ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_СЕССИЯ.ЧЛВК_ИД
	WHERE
		Н_ЛЮДИ.ИД = 100012 AND
		Н_СЕССИЯ.ДАТА < '2004-01-17';

-- 3
SELECT COUNT(*)
	FROM Н_ЛЮДИ LEFT JOIN Н_ВЕДОМОСТИ
		ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
	RIGHT JOIN Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК
		ON Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК.ИД = Н_ВЕДОМОСТИ.СЭС_ИД
	LEFT JOIN Н_ЭЛЕМЕНТЫ_СТРОК
		ON Н_ЭЛЕМЕНТЫ_СТРОК.ИД = Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК.ЭСТ_ИД
	INNER JOIN Н_ОТДЕЛЫ
		ON Н_ЭЛЕМЕНТЫ_СТРОК.ОТД_ИД = Н_ОТДЕЛЫ.ИД
	WHERE Н_ЛЮДИ.ОТЧЕСТВО = '.' AND
		  Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ';

-- 4
SELECT Н_ПЛАНЫ.ПЛАН_ИД
	FROM Н_ГРУППЫ_ПЛАНОВ INNER JOIN Н_ПЛАНЫ
		ON Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
	INNER JOIN Н_ОТДЕЛЫ
		ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
	WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ'
	GROUP BY Н_ПЛАНЫ.ПЛАН_ИД
	HAVING COUNT(*) > 1;

-- 5
SELECT ЧЛВК_ИД, ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО, СРЕДНИЙ_БАЛЛ
	FROM Н_ЛЮДИ INNER JOIN
	(
		SELECT Н_УЧЕНИКИ.ЧЛВК_ИД, AVG(CAST(ОЦЕНКА AS REAL)) AS СРЕДНИЙ_БАЛЛ
			FROM Н_ВЕДОМОСТИ RIGHT JOIN Н_УЧЕНИКИ
				ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
			WHERE ОЦЕНКА SIMILAR TO '\d' AND
				ГРУППА = '4100'
			GROUP BY Н_УЧЕНИКИ.ЧЛВК_ИД
	) ОЦ
	ON Н_ЛЮДИ.ИД = ОЦ.ЧЛВК_ИД
	WHERE СРЕДНИЙ_БАЛЛ >= (
		SELECT MAX(СРЕДНИЙ_БАЛЛ)
			FROM
			(
				SELECT AVG(CAST(ОЦЕНКА AS REAL)) AS СРЕДНИЙ_БАЛЛ
					FROM Н_ВЕДОМОСТИ RIGHT JOIN Н_УЧЕНИКИ
						ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
					WHERE ОЦЕНКА SIMILAR TO '\d' AND
						ГРУППА = '1101'
				GROUP BY Н_УЧЕНИКИ.ЧЛВК_ИД
			)
	);


-- 6
SELECT
    Н_УЧЕНИКИ.ГРУППА,
    Н_УЧЕНИКИ.ИД, 
    Н_ЛЮДИ.ФАМИЛИЯ, 
    Н_ЛЮДИ.ИМЯ, 
    Н_ЛЮДИ.ОТЧЕСТВО,
    Н_УЧЕНИКИ.В_СВЯЗИ_С AS НОМЕР_ПРИКАЗА, 
    Н_УЧЕНИКИ.СОСТОЯНИЕ AS СОСТОЯНИЕ_ПРИКАЗА
	
	FROM Н_ЛЮДИ RIGHT JOIN Н_УЧЕНИКИ
		ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
    JOIN Н_ПЛАНЫ
    	ON Н_ПЛАНЫ.ИД = Н_УЧЕНИКИ.ПЛАН_ИД
    JOIN Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ
    	ON Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД = Н_ПЛАНЫ.НАПС_ИД
    JOIN Н_ФОРМЫ_ОБУЧЕНИЯ 
    	ON Н_ФОРМЫ_ОБУЧЕНИЯ.ИД = Н_ПЛАНЫ.ФО_ИД
    JOIN Н_НАПР_СПЕЦ
    	ON Н_НАПР_СПЕЦ.ИД = Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД
    WHERE 
        Н_УЧЕНИКИ.НАЧАЛО < '2012-09-01' AND
       	Н_ПЛАНЫ.КУРС = 1 AND
        (Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная' OR Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Заочная') AND
        Н_НАПР_СПЕЦ.КОД_НАПРСПЕЦ = '230101';

-- 7
SELECT ИМЯ, ДАТА_РОЖДЕНИЯ FROM
		Н_ЛЮДИ 
		WHERE NOT EXISTS
		(
			SELECT 1
					FROM Н_ЛЮДИ Н_ЛЮДИ_2
					WHERE Н_ЛЮДИ.ИМЯ = Н_ЛЮДИ_2.ИМЯ AND
					Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ = Н_ЛЮДИ_2.ДАТА_РОЖДЕНИЯ AND
					Н_ЛЮДИ.ИД != Н_ЛЮДИ_2.ИД
		)
ORDER BY ИМЯ, ДАТА_РОЖДЕНИЯ;
