-- 1
SELECT КОД, ДАТА
	FROM Н_ОЦЕНКИ RIGHT JOIN Н_ВЕДОМОСТИ 
		ON Н_ВЕДОМОСТИ.ОЦЕНКА = Н_ОЦЕНКИ.КОД 
	WHERE 
		Н_ОЦЕНКИ.ПРИМЕЧАНИЕ < 'неудовлетворительно' AND 
		Н_ВЕДОМОСТИ.ИД < 1490007;

-- 2
SELECT ЧЛВК_И_ВЕД.ИД, ЧЛВК_И_ВЕД.ЧЛВК_ИД, Н_СЕССИЯ.УЧГОД
	FROM 
		(
			SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ЧЛВК_ИД FROM
				(SELECT ИД FROM Н_ЛЮДИ WHERE ИД = 100012) Н_ЛЮДИ LEFT JOIN Н_ВЕДОМОСТИ
					ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
				WHERE
					ДАТА < '2022-06-08'
		) ЧЛВК_И_ВЕД LEFT JOIN Н_СЕССИЯ
			ON ЧЛВК_И_ВЕД.ЧЛВК_ИД = Н_СЕССИЯ.ЧЛВК_ИД
		WHERE
			Н_СЕССИЯ.ДАТА < '2004-01-17';

-- 3
SELECT COUNT(*)
	FROM (
		(
			SELECT ОТД_ИД AS ОТД FROM (
				SELECT ЭСТ_ИД FROM (
					SELECT Н_ВЕДОМОСТИ.СЭС_ИД
						FROM Н_ЛЮДИ LEFT JOIN Н_ВЕДОМОСТИ
							ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
						WHERE Н_ЛЮДИ.ОТЧЕСТВО = '.'
				)
				RIGHT JOIN Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК
					ON Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК.ИД = СЭС_ИД
			)
			LEFT JOIN Н_ЭЛЕМЕНТЫ_СТРОК
				ON Н_ЭЛЕМЕНТЫ_СТРОК.ИД = ЭСТ_ИД
		) 
		LEFT JOIN Н_ОТДЕЛЫ
			ON ОТД = Н_ОТДЕЛЫ.ИД
	)
	WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ';

-- 4
SELECT ГРУППА_И_ПЛАН.ПЛАН_ИД
	FROM Н_ОТДЕЛЫ INNER JOIN (
		SELECT Н_ГРУППЫ_ПЛАНОВ.ГРУППА, Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД, Н_ПЛАНЫ.ОТД_ИД
			FROM Н_ГРУППЫ_ПЛАНОВ INNER JOIN Н_ПЛАНЫ
				ON Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
	) ГРУППА_И_ПЛАН
	ON ГРУППА_И_ПЛАН.ОТД_ИД = Н_ОТДЕЛЫ.ИД
	WHERE
		Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ'
	GROUP BY ГРУППА_И_ПЛАН.ПЛАН_ИД
	HAVING COUNT(*) > 1
	ORDER BY ГРУППА_И_ПЛАН.ПЛАН_ИД;

-- 5
SELECT ЧЛВК_ИД, ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО, СРЕДНИЙ_БАЛЛ
	FROM Н_ЛЮДИ INNER JOIN
	(
		SELECT Н_УЧ.ЧЛВК_ИД, AVG(CAST(ОЦЕНКА AS REAL)) AS СРЕДНИЙ_БАЛЛ
			FROM Н_ВЕДОМОСТИ RIGHT JOIN
			(
				SELECT ЧЛВК_ИД
					FROM Н_УЧЕНИКИ
					WHERE ГРУППА = '4100'
			) Н_УЧ
			ON Н_УЧ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
			WHERE ОЦЕНКА SIMILAR TO '\d'
			GROUP BY Н_УЧ.ЧЛВК_ИД
	) ОЦ
	ON Н_ЛЮДИ.ИД = ОЦ.ЧЛВК_ИД
	WHERE СРЕДНИЙ_БАЛЛ >= (
		SELECT MAX(СРЕДНИЙ_БАЛЛ)
			FROM
			(
				SELECT AVG(CAST(ОЦЕНКА AS REAL)) AS СРЕДНИЙ_БАЛЛ
					FROM Н_ВЕДОМОСТИ RIGHT JOIN
					(
						SELECT ЧЛВК_ИД
							FROM Н_УЧЕНИКИ
							WHERE ГРУППА = '1101'
					) Н_УЧ
					ON Н_УЧ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
					WHERE ОЦЕНКА SIMILAR TO '\d'
					GROUP BY Н_УЧ.ЧЛВК_ИД
			)
	);

-- 6
SELECT
	Н_УЧЕНИКИ_ИЗМЕН.ГРУППА,
	Н_УЧЕНИКИ_ИЗМЕН.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО,
	Н_УЧЕНИКИ_ИЗМЕН.НОМЕР_ПРИКАЗА, Н_УЧЕНИКИ_ИЗМЕН.СОСТОЯНИЕ_ПРИКАЗА

	FROM Н_ЛЮДИ RIGHT JOIN
	(
		SELECT Н_УЧЕНИКИ.ГРУППА, Н_УЧЕНИКИ.ИД, Н_УЧЕНИКИ.ЧЛВК_ИД, Н_УЧЕНИКИ.СОСТОЯНИЕ AS СОСТОЯНИЕ_ПРИКАЗА, Н_УЧЕНИКИ.В_СВЯЗИ_С AS НОМЕР_ПРИКАЗА
			FROM Н_УЧЕНИКИ RIGHT JOIN
			(
				SELECT ПЛАН_ИЗМЕН.ИД 
					FROM Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ RIGHT JOIN
					(
						SELECT ИД, НАПС_ИД 
							FROM Н_ПЛАНЫ 
							WHERE 
								КУРС = 1 AND
								ФО_ИД IN (
									SELECT ИД
										FROM Н_ФОРМЫ_ОБУЧЕНИЯ
										WHERE НАИМЕНОВАНИЕ = 'Очная' OR НАИМЕНОВАНИЕ = 'Заочная'
								)
					) ПЛАН_ИЗМЕН
					ON Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД = ПЛАН_ИЗМЕН.НАПС_ИД
					WHERE Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД = (
						SELECT ИД
							FROM Н_НАПР_СПЕЦ
							WHERE КОД_НАПРСПЕЦ = '230101'
					)
			) ПЛАНЫ_ИЗМЕН_2
			ON ПЛАНЫ_ИЗМЕН_2.ИД = Н_УЧЕНИКИ.ПЛАН_ИД
			WHERE Н_УЧЕНИКИ.НАЧАЛО < '2012-09-01'
	) Н_УЧЕНИКИ_ИЗМЕН
	ON Н_УЧЕНИКИ_ИЗМЕН.ЧЛВК_ИД = Н_ЛЮДИ.ИД;
-- 7
SELECT ИМЯ, ДАТА_РОЖДЕНИЯ FROM
		Н_ЛЮДИ 
		WHERE NOT EXISTS
		(
			SELECT 1
					FROM Н_ЛЮДИ Н_ЛЮДИ_2
					WHERE Н_ЛЮДИ.ИМЯ = Н_ЛЮДИ_2.ИМЯ AND
					Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ = Н_ЛЮДИ_2.ДАТА_РОЖДЕНИЯ AND
					Н_ЛЮДИ.ИД != Н_ЛЮДИ_2.ИД
		)
ORDER BY ИМЯ, ДАТА_РОЖДЕНИЯ;

